{
	"ID": "ALAS2-2022-1855",
	"Author": "linux-security@amazon.com",
	"From": "linux-security@amazon.com",
	"Status": "final",
	"Type": "security",
	"Version": "1.4",
	"Title": "Amazon Linux 2 2017.12 - ALAS2-2022-1855: important priority package update for thunderbird",
	"Issued": {
		"Date": "2022-09-30 07:04:00"
	},
	"Updated": {
		"Date": "2022-10-10 21:54:00"
	},
	"Severity": "important",
	"Description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2022-38478:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of members on the Mozilla Fuzzing Team reporting memory safety bugs present in Firefox 103, Firefox ESR 102.1, and Firefox ESR 91.12. Some of these bugs showed evidence of memory corruption, and we presume that with enough effort, some of these could have been exploited to run arbitrary code.\n\nCVE-2022-38477:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of Mozilla developer Nika Layzell and the Mozilla Fuzzing Team, reporting memory safety bugs present in Firefox 103 and Firefox ESR 102.1. Some of these bugs showed evidence of memory corruption, and we presume that with enough effort, some of these could have been exploited to run arbitrary code.\n\nCVE-2022-38476:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of a data race that could occur in the `PK11_ChangePW` function, potentially leading to a use-after-free vulnerability. In Firefox, this lock protected the data when a user changed their master password.\n\nCVE-2022-38473:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of a cross-origin iframe referencing an XSLT document inheriting the parent domain's permissions (such as microphone or camera access).\n\nCVE-2022-38472:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of an attacker abusing XSLT error handling to associate attacker-controlled content with another origin, which was displayed in the address bar. This issue could be used to fool the user into submitting data intended for the spoofed origin.\n\nCVE-2022-36319:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of when combining CSS properties for overflow and transform, the mouse cursor could interact with different coordinates than displayed.\n\nCVE-2022-36318:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of when visiting directory listings for `chrome://` URLs as source text, some parameters were reflected.\n\nCVE-2022-2505:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of Mozilla developers and the Mozilla Fuzzing Team reporting memory safety bugs in Firefox 102. Some of these bugs showed evidence of memory corruption, and we presume that with enough effort, some of these could have been exploited to run arbitrary code.\n",
	"References": {
		"Reference": [
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-2505",
				"ID": "CVE-2022-2505",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-36318",
				"ID": "CVE-2022-36318",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-36319",
				"ID": "CVE-2022-36319",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-38472",
				"ID": "CVE-2022-38472",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-38473",
				"ID": "CVE-2022-38473",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-38476",
				"ID": "CVE-2022-38476",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-38477",
				"ID": "CVE-2022-38477",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-38478",
				"ID": "CVE-2022-38478",
				"Title": "",
				"Type": "cve"
			}
		]
	},
	"Pkglist": {
		"Collection": {
			"Short": "amazon-linux-2",
			"Name": "Amazon Linux 2",
			"Package": [
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "thunderbird",
					"Release": "1.amzn2.0.1",
					"Version": "91.13.0",
					"Filename": "Packages/thunderbird-91.13.0-1.amzn2.0.1.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "thunderbird-debuginfo",
					"Release": "1.amzn2.0.1",
					"Version": "91.13.0",
					"Filename": "Packages/thunderbird-debuginfo-91.13.0-1.amzn2.0.1.x86_64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "thunderbird",
					"Release": "1.amzn2.0.1",
					"Version": "91.13.0",
					"Filename": "Packages/thunderbird-91.13.0-1.amzn2.0.1.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "thunderbird-debuginfo",
					"Release": "1.amzn2.0.1",
					"Version": "91.13.0",
					"Filename": "Packages/thunderbird-debuginfo-91.13.0-1.amzn2.0.1.aarch64.rpm"
				}
			]
		}
	}
}
