{
  "ID": "ALAS2-2019-1376",
  "Author": "linux-security@amazon.com",
  "From": "linux-security@amazon.com",
  "Status": "final",
  "Type": "security",
  "Version": "1.4",
  "Title": "Amazon Linux 2 2017.12 - ALAS2-2019-1376: important priority package update for thunderbird",
  "Issued": {
    "Date": "2019-12-13 19:41"
  },
  "Updated": {
    "Date": "2019-12-18 01:25"
  },
  "Severity": "important",
  "Description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2019-15903:\n\tIn libexpat before 2.2.8, crafted XML input could fool the parser into changing from DTD parsing to document parsing too early; a consecutive call to XML_GetCurrentLineNumber (or XML_GetCurrentColumnNumber) then resulted in a heap-based buffer over-read.\n1752592: CVE-2019-15903 expat: heap-based buffer over-read via crafted XML input\n\nCVE-2019-11764:\n\tSeveral memory safety bugs were discovered in Mozilla Firefox and Thunderbird. Memory corruption and arbitrary code execution are possible with these vulnerabilities. These bugs can be exploited over the network.\n1764446: CVE-2019-11764 Mozilla: Memory safety bugs fixed in Firefox 70 and Firefox ESR 68.2\n\nCVE-2019-11763:\n\tA flaw was found in Mozilla Firefox and Thunderbird where null bytes were incorrectly parsed in HTML entities. This could lead to HTML comments being treated as code which could lead to XSS in a web application or HTML entities being masked from filters.\n1764444: CVE-2019-11763 Mozilla: Incorrect HTML parsing results in XSS bypass technique\n\nCVE-2019-11762:\n\tA flaw was found in Mozilla's firefox and thunderbird where if two same-origin documents set document.domain differently to become cross-origin, it was possible for them to call arbitrary DOM methods/getters/setters on the now-cross-origin window. This could cause an interaction between two different sites on two different windows running under the same application.\n1764443: CVE-2019-11762 Mozilla: document.domain-based origin isolation has same-origin-property violation\n\nCVE-2019-11761:\n\tA vulnerability was found in Mozilla Firefox and Thunderbird. Privileged JSONView objects that have been cloned into content can be accessed using a form with a data URI. This flaw bypasses existing defense-in-depth mechanisms and can be exploited over the network.\n1764442: CVE-2019-11761 Mozilla: Unintended access to a privileged JSONView object\n\nCVE-2019-11760:\n\tA flaw was discovered in Mozilla Firefox and Thunderbird where a fixed-stack buffer overflow could occur during WebRTC signalling. The vulnerability could lead to an exploitable crash or leak data.\n1764441: CVE-2019-11760 Mozilla: Stack buffer overflow in WebRTC networking\n\nCVE-2019-11759:\n\tA flaw was discovered in both Firefox and Thunderbird where 4 bytes of a HMAC output could be written past the end of a buffer stored on the memory stack. This could allow an attacker to execute arbitrary code or lead to a crash. This flaw can be exploited over the network.\n1764440: CVE-2019-11759 Mozilla: Stack buffer overflow in HKDF output\n\nCVE-2019-11758:\n\tA flaw was found in the 360 Total Security code in Firefox and Thunderbird. Memory corruption is possible in the accessibility engine that could lead to an exploit to run arbitrary code. This vulnerability could be exploited over a network connection and would affect confidentiality and integrity of information as well as availability of the system.\n1764439: CVE-2019-11758 Mozilla: Potentially exploitable crash due to 360 Total Security\n\nCVE-2019-11757:\n\tA use-after-free flaw was found in Mozilla Firefox and Thunderbird. When following a value's prototype chain, it was possible to retain a reference to a locale, delete it, and subsequently reference it. An attacker could use this flaw to execute code that was stored in the referenced memory or crash the system.\n1764438: CVE-2019-11757 Mozilla: Use-after-free when creating index updates in IndexedDB\n",
  "References": {
    "Reference": [
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11757",
        "ID": "CVE-2019-11757",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11758",
        "ID": "CVE-2019-11758",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11759",
        "ID": "CVE-2019-11759",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11760",
        "ID": "CVE-2019-11760",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11761",
        "ID": "CVE-2019-11761",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11762",
        "ID": "CVE-2019-11762",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11763",
        "ID": "CVE-2019-11763",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11764",
        "ID": "CVE-2019-11764",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-15903",
        "ID": "CVE-2019-15903",
        "Title": "",
        "Type": "cve"
      }
    ]
  },
  "Pkglist": {
    "Collection": {
      "Short": "amazon-linux-2",
      "Name": "Amazon Linux 2",
      "Package": [
        {
          "Arch": "x86_64",
          "Epoch": "0",
          "Name": "thunderbird",
          "Release": "1.amzn2.0.1",
          "Version": "68.2.0",
          "Filename": "Packages/thunderbird-68.2.0-1.amzn2.0.1.x86_64.rpm"
        },
        {
          "Arch": "x86_64",
          "Epoch": "0",
          "Name": "thunderbird-debuginfo",
          "Release": "1.amzn2.0.1",
          "Version": "68.2.0",
          "Filename": "Packages/thunderbird-debuginfo-68.2.0-1.amzn2.0.1.x86_64.rpm"
        }
      ]
    }
  }
}
