{
	"ID": "ALAS2KERNEL-5.10-2022-002",
	"Author": "linux-security@amazon.com",
	"From": "linux-security@amazon.com",
	"Status": "final",
	"Type": "security",
	"Version": "1.4",
	"Title": "Amazon Linux 2 - Kernel-5.10 2.0 - ALAS2KERNEL-5.10-2022-002: important priority package update for kernel",
	"Issued": {
		"Date": "2022-01-20 23:37:00"
	},
	"Updated": {
		"Date": "2024-06-19 20:39:00"
	},
	"Severity": "important",
	"Description": "Package updates are available for Amazon Linux 2 - Kernel-5.10 that fix the following vulnerabilities:\nCVE-2021-47227:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nx86/fpu: Prevent state corruption in __fpu__restore_sig()\n\nCVE-2021-47175:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nnet/sched: fq_pie: fix OOB access in the traffic path\n\nCVE-2021-47166:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nNFS: Don't corrupt the value of pg_bytes_written in nfs_do_recoalesce()\n\nCVE-2021-47131:\n\tIn the Linux kernel, the following vulnerability has been resolved: net/tls: Fix use-after-free after the TLS device goes down and up When a netdev with active TLS offload goes down, tls_device_down is called to stop the offload and tear down the TLS context. However, the socket stays alive, and it still points to the TLS context, which is now deallocated. If a netdev goes up, while the connection is still active, and the data flow resumes after a number of TCP retransmissions, it will lead to a use-after-free of the TLS context. This commit addresses this bug by keeping the context alive until its normal destruction, and implements the necessary fallbacks, so that the connection can resume in software (non-offloaded) kTLS mode.\n\nCVE-2021-47110:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nx86/kvm: Disable kvmclock on all CPUs on shutdown\n\nCVE-2021-47035:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\niommu/vt-d: Remove WO permissions on second-level paging entries\n\nCVE-2021-47015:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nbnxt_en: Fix RX consumer index logic in the error path.\n\nCVE-2021-47013:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nnet:emac/emac-mac: Fix a use after free in emac_mac_tx_buf_send\n\nCVE-2021-47011:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nmm: memcontrol: slab: fix obtain a reference to a freeing memcg\n\nCVE-2021-47010:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nnet: Only allow init netns to set default tcp cong to a restricted algo\n\nCVE-2021-47009:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nKEYS: trusted: Fix memory leak on object td\n\nCVE-2021-47006:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nARM: 9064/1: hw_breakpoint: Do not directly check the event's overflow_handler hook\n\nCVE-2021-47001:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nxprtrdma: Fix cwnd update ordering\n\nCVE-2021-47000:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nceph: fix inode leak on getattr error in __fh_to_dentry\n\nCVE-2021-46997:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\narm64: entry: always set GIC_PRIO_PSR_I_SET during entry\n\nCVE-2021-46996:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nnetfilter: nftables: Fix a memleak from userdata error path in new objects\n\nCVE-2021-46993:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nsched: Fix out-of-bound access in uclamp\n\nCVE-2021-46985:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nACPI: scan: Fix a memory leak in an error handling path\n\nCVE-2021-46981:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nnbd: Fix NULL pointer in flush_workqueue\n\nCVE-2021-46978:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nKVM: nVMX: Always make an attempt to map eVMCS after migration\n\nCVE-2021-46977:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nKVM: VMX: Disable preemption when probing user return MSRs\n\nCVE-2021-46976:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\ndrm/i915: Fix crash in auto_retire\n\nCVE-2021-46963:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nscsi: qla2xxx: Fix crash in qla2xxx_mqueuecommand()\n\nCVE-2021-46961:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nirqchip/gic-v3: Do not enable irqs when handling spurious interrups\n\nCVE-2021-46960:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\ncifs: Return correct error code from smb2_get_enc_key\n\nCVE-2021-46958:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nbtrfs: fix race between transaction aborts and fsyncs leading to use-after-free\n\nCVE-2021-46956:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nvirtiofs: fix memory leak in virtio_fs_probe()\n\nCVE-2021-46955:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nopenvswitch: fix stack OOB read while fragmenting IPv4 packets\n\nCVE-2021-46953:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nACPI: GTDT: Don't corrupt interrupt mappings on watchdow probe failure\n\nCVE-2021-46952:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nNFS: fs_context: validate UDP retrans to prevent shift out-of-bounds\n\nCVE-2021-46951:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\ntpm: efi: Use local variable for calculating final log size\n\nCVE-2021-46950:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nmd/raid1: properly indicate failure when ending a failed write request\n\nThis patch addresses a data corruption bug in raid1 arrays using bitmaps.\nWithout this fix, the bitmap bits for the failed I/O end up being cleared.\n\nSince we are in the failure leg of raid1_end_write_request, the request\neither needs to be retried (R1BIO_WriteError) or failed (R1BIO_Degraded).\n\nCVE-2021-46939:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\ntracing: Restructure trace_clock_global() to never block\n\nCVE-2021-46938:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\ndm rq: fix double free of blk_mq_tag_set in dev remove after table load fails\n\nCVE-2021-46906:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nHID: usbhid: fix info leak in hid_submit_ctrl\n\nIn hid_submit_ctrl(), the way of calculating the report length doesn't\ntake into account that report->size can be zero. When running the\nsyzkaller reproducer, a report of size 0 causes hid_submit_ctrl) to\ncalculate transfer_buffer_length as 16384. When this urb is passed to\nthe usb core layer, KMSAN reports an info leak of 16384 bytes.\n\nTo fix this, first modify hid_report_len() to account for the zero\nreport size case by using DIV_ROUND_UP for the division. Then, call it\nfrom hid_submit_ctrl().\n\nCVE-2021-38208:\n\tA flaw was found in the Linux kernels NFC implementation, A NULL pointer dereference and BUG leading to a denial of service can be triggered by a local unprivileged user causing a kernel panic.\n\nCVE-2021-3573:\n\tA flaw use-after-free in function hci_sock_bound_ioctl() of the Linux kernel HCI subsystem was found in the way user calls ioct HCIUNBLOCKADDR or other way triggers race condition of the call hci_unregister_dev() together with one of the calls hci_sock_blacklist_add(), hci_sock_blacklist_del(), hci_get_conn_info(), hci_get_auth_info(). A privileged local user could use this flaw to crash the system or escalate their privileges on the system.\n\nCVE-2021-3564:\n\tA flaw double-free memory corruption in the Linux kernel HCI device initialization subsystem was found in the way user attach malicious HCI TTY Bluetooth device. A local user could use this flaw to crash the system.\n\nCVE-2021-3543:\n\tA flaw null pointer dereference in the Nitro Enclaves kernel driver was found in the way that Enclaves VMs forces closures on the enclave file descriptor. A local user of a host machine could use this flaw to crash the system or escalate their privileges on the system.\n\nCVE-2021-3506:\n\tAn out-of-bounds (OOB) memory access flaw was found in fs/f2fs/node.c in the f2fs module in the Linux kernel. A bounds check failure allows a local attacker to gain access to out-of-bounds memory leading to a system crash or a leak of internal kernel information. The highest threat from this vulnerability is to system availability.\n\nCVE-2021-3491:\n\tA flaw was found in the Linux kernel.  The io_uring PROVIDE_BUFFERS operation allowed the MAX_RW_COUNT limit to be bypassed, which led to negative values being used in mem_rw when reading /proc/<PID>/mem. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability.\n\nCVE-2021-3490:\n\tThe eBPF ALU32 bounds tracking for bitwise ops (AND, OR and XOR) in the Linux kernel did not properly update 32-bit bounds, which could be turned into out of bounds reads and writes in the Linux kernel and therefore, arbitrary code execution. This issue was fixed via commit 049c4e13714e (\"bpf: Fix alu32 const subreg bound tracking on bitwise operations\") (v5.13-rc4) and backported to the stable kernels in v5.12.4, v5.11.21, and v5.10.37. The AND/OR issues were introduced by commit 3f50f132d840 (\"bpf: Verifier, do explicit ALU32 bounds tracking\") (5.7-rc1) and the XOR variant was introduced by 2921c90d4718 (\"bpf:Fix a verifier failure with xor\") ( 5.10-rc1).\n\nCVE-2021-3489:\n\tThe eBPF RINGBUF bpf_ringbuf_reserve() function in the Linux kernel did not check that the allocated size was smaller than the ringbuf size, allowing an attacker to perform out-of-bounds writes within the kernel and therefore, arbitrary code execution. This issue was fixed via commit 4b81ccebaeee (\"bpf, ringbuf: Deny reserve of buffers larger than ringbuf\") (v5.13-rc4) and backported to the stable kernels in v5.12.4, v5.11.21, and v5.10.37. It was introduced via 457f44363a88 (\"bpf: Implement BPF ring buffer and verifier support for it\") (v5.8-rc1).\n\nCVE-2021-34693:\n\tThe canbus filesystem in the Linux kernel contains an information leak of kernel memory to devices on the CAN bus network link layer.  An attacker with the ability to dump messages on the CAN bus is able to learn of uninitialized stack values by dumbing messages on the can bus.\n\nCVE-2021-33624:\n\tIn kernel/bpf/verifier.c in the Linux kernel before 5.12.13, a branch can be mispredicted (e.g., because of type confusion) and consequently an unprivileged BPF program can read arbitrary memory locations via a side-channel attack, aka CID-9183671af6db.\n\nCVE-2021-33034:\n\tA use-after-free flaw was found in hci_send_acl in the bluetooth host controller interface (HCI) in Linux kernel, where a local attacker with an access rights could cause a denial of service problem on the system  The issue results from the object hchan, freed in hci_disconn_loglink_complete_evt, yet still used in other places. The highest threat from this vulnerability is to data integrity, confidentiality and system availability.\n\nCVE-2021-32399:\n\tA flaw was found in the Linux kernel's handling of the removal of Bluetooth HCI controllers. This flaw allows an attacker with a local account to exploit a race condition, leading to corrupted memory and possible privilege escalation. The highest threat from this vulnerability is to confidentiality, integrity, as well as system availability.\n\nCVE-2021-31440:\n\tAn out-of-bounds access flaw was found in the Linux kernel's implementation of the eBPF code verifier, where an incorrect register bounds calculation while checking unsigned 32-bit instructions in an eBPF program occurs.. By default accessing the eBPF verifier is only accessible to privileged users with CAP_SYS_ADMIN. The issue results from the lack of proper validation of user-supplied eBPF programs prior to executing them. A local user could use this flaw to crash the system or possibly escalate their privileges on the system.\n\nCVE-2021-28691:\n\tGuest triggered use-after-free in Linux xen-netback A malicious or buggy network PV frontend can force Linux netback to disable the interface and terminate the receive kernel thread associated with queue 0 in response to the frontend sending a malformed packet. Such kernel thread termination will lead to a use-after-free in Linux netback when the backend is destroyed, as the kernel thread associated with queue 0 will have already exited and thus the call to kthread_stop will be performed against a stale pointer.\n\nCVE-2021-22543:\n\tA flaw was found in the Linux kernel's KVM implementation, where improper handing of the VM_IO|VM_PFNMAP VMAs in KVM bypasses RO checks and leads to pages being freed while still accessible by the VMM and guest. This flaw allows users who can start and control a VM to read/write random pages of memory, resulting in local privilege escalation. The highest threat from this vulnerability is to confidentiality, integrity, and system availability.\n\nCVE-2021-0129:\n\tA flaw was found in the Linux kernel. Improper access control in BlueZ may allow an authenticated user to potentially enable information disclosure via adjacent access. The highest threat from this vulnerability is to data confidentiality and integrity.\n\nCVE-2020-36776:\n\tIn the Linux kernel, the following vulnerability has been resolved:\n\nthermal/drivers/cpufreq_cooling: Fix slab OOB issue\n\nCVE-2020-26558:\n\tA vulnerability was found in the bluez, where Passkey Entry protocol used in Secure Simple Pairing (SSP), Secure Connections (SC) and LE Secure Connections (LESC) of the Bluetooth Core Specification is vulnerable to an impersonation attack where an active attacker can impersonate the initiating device without any previous knowledge.\n\nCVE-2020-26541:\n\tA flaw was found in the Linux kernel in certs/blacklist.c, When signature entries for EFI_CERT_X509_GUID are contained in the Secure Boot Forbidden Signature Database, the entries are skipped. This can cause a security threat and breach system integrity, confidentiality and even lead to a denial of service problem.\n\nCVE-2020-26147:\n\tA flaw was found in ieee80211_rx_h_defragment in net/mac80211/rx.c in the Linux Kernel's WiFi implementation. This vulnerability can be abused to inject packets or exfiltrate selected fragments when another device sends fragmented frames, and the WEP, CCMP, or GCMP data-confidentiality protocol is used. The highest threat from this vulnerability is to integrity.\n\nCVE-2020-26145:\n\tA flaw was found in ath10k_htt_rx_proc_rx_frag_ind_hl in drivers/net/wireless/ath/ath10k/htt_rx.c in the Linux kernel WiFi implementations, where it accepts a second (or subsequent) broadcast fragments even when sent in plaintext and then process them as full unfragmented frames. The highest threat from this vulnerability is to integrity.\n\nCVE-2020-26141:\n\tA vulnerability was found in Linux kernel's WiFi implementation.  An attacker within wireless range can inject a control packet fragment where the kernel does not verify the Message Integrity Check (authenticity) of fragmented TKIP frames.\n\nCVE-2020-26139:\n\tFrames used for authentication and key management between the AP and connected clients.  Some clients may take these redirected frames masquerading as control mechanisms from the AP.\n\nCVE-2020-24588:\n\tA flaw was found in the Linux kernels wifi implementation. An attacker within wireless broadcast range can inject custom data into the wireless communication circumventing checks on the data.  This can cause the frame to pass checks and be considered a valid frame of a different type.\n\nCVE-2020-24587:\n\tA flaw was found in the Linux kernel's WiFi implementation. An attacker within the wireless range can abuse a logic flaw in the WiFi implementation by reassembling packets from multiple fragments under different keys, treating them as valid. This flaw allows an attacker to send a fragment under an incorrect key, treating them as a valid fragment under the new key. The highest threat from this vulnerability is to confidentiality.\n\nCVE-2020-24586:\n\tA flaw was found in the Linux kernels implementation of wifi fragmentation handling. An attacker with the ability to transmit within the wireless transmission range of an access point can abuse a flaw where previous contents of wifi fragments can be unintentionally transmitted to another device.\n",
	"References": {
		"Reference": [
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-24586",
				"ID": "CVE-2020-24586",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-24587",
				"ID": "CVE-2020-24587",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-24588",
				"ID": "CVE-2020-24588",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26139",
				"ID": "CVE-2020-26139",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26141",
				"ID": "CVE-2020-26141",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26145",
				"ID": "CVE-2020-26145",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26147",
				"ID": "CVE-2020-26147",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26541",
				"ID": "CVE-2020-26541",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26558",
				"ID": "CVE-2020-26558",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-36776",
				"ID": "CVE-2020-36776",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-0129",
				"ID": "CVE-2021-0129",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-22543",
				"ID": "CVE-2021-22543",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-28691",
				"ID": "CVE-2021-28691",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-31440",
				"ID": "CVE-2021-31440",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-32399",
				"ID": "CVE-2021-32399",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-33034",
				"ID": "CVE-2021-33034",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-33624",
				"ID": "CVE-2021-33624",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-34693",
				"ID": "CVE-2021-34693",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3489",
				"ID": "CVE-2021-3489",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3490",
				"ID": "CVE-2021-3490",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3491",
				"ID": "CVE-2021-3491",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3506",
				"ID": "CVE-2021-3506",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3543",
				"ID": "CVE-2021-3543",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3564",
				"ID": "CVE-2021-3564",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-3573",
				"ID": "CVE-2021-3573",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-38208",
				"ID": "CVE-2021-38208",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46906",
				"ID": "CVE-2021-46906",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46938",
				"ID": "CVE-2021-46938",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46939",
				"ID": "CVE-2021-46939",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46950",
				"ID": "CVE-2021-46950",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46951",
				"ID": "CVE-2021-46951",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46952",
				"ID": "CVE-2021-46952",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46953",
				"ID": "CVE-2021-46953",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46955",
				"ID": "CVE-2021-46955",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46956",
				"ID": "CVE-2021-46956",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46958",
				"ID": "CVE-2021-46958",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46960",
				"ID": "CVE-2021-46960",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46961",
				"ID": "CVE-2021-46961",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46963",
				"ID": "CVE-2021-46963",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46976",
				"ID": "CVE-2021-46976",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46977",
				"ID": "CVE-2021-46977",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46978",
				"ID": "CVE-2021-46978",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46981",
				"ID": "CVE-2021-46981",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46985",
				"ID": "CVE-2021-46985",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46993",
				"ID": "CVE-2021-46993",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46996",
				"ID": "CVE-2021-46996",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-46997",
				"ID": "CVE-2021-46997",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47000",
				"ID": "CVE-2021-47000",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47001",
				"ID": "CVE-2021-47001",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47006",
				"ID": "CVE-2021-47006",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47009",
				"ID": "CVE-2021-47009",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47010",
				"ID": "CVE-2021-47010",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47011",
				"ID": "CVE-2021-47011",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47013",
				"ID": "CVE-2021-47013",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47015",
				"ID": "CVE-2021-47015",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47035",
				"ID": "CVE-2021-47035",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47110",
				"ID": "CVE-2021-47110",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47131",
				"ID": "CVE-2021-47131",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47166",
				"ID": "CVE-2021-47166",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47175",
				"ID": "CVE-2021-47175",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-47227",
				"ID": "CVE-2021-47227",
				"Title": "",
				"Type": "cve"
			}
		]
	},
	"Pkglist": {
		"Collection": {
			"Short": "amazon-linux-2---kernel-5.10",
			"Name": "Amazon Linux 2 - Kernel-5.10",
			"Package": [
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-headers",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-headers-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-debuginfo-common-aarch64",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-debuginfo-common-aarch64-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "perf",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/perf-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "perf-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/perf-debuginfo-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "python-perf",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/python-perf-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "python-perf-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/python-perf-debuginfo-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-tools",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-tools-devel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-devel-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-tools-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-debuginfo-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "bpftool",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/bpftool-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "bpftool-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/bpftool-debuginfo-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-devel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-devel-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "kernel-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-debuginfo-5.10.47-39.130.amzn2.aarch64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-headers",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-headers-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-debuginfo-common-x86_64",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-debuginfo-common-x86_64-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "perf",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/perf-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "perf-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/perf-debuginfo-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "python-perf",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/python-perf-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "python-perf-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/python-perf-debuginfo-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-tools",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-tools-devel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-devel-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-tools-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-tools-debuginfo-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "bpftool",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/bpftool-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "bpftool-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/bpftool-debuginfo-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-devel",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-devel-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "kernel-debuginfo",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-debuginfo-5.10.47-39.130.amzn2.x86_64.rpm"
				},
				{
					"Arch": "i686",
					"Epoch": "0",
					"Name": "kernel-headers",
					"Release": "39.130.amzn2",
					"Version": "5.10.47",
					"Filename": "Packages/kernel-headers-5.10.47-39.130.amzn2.i686.rpm"
				}
			]
		}
	}
}
