{
	"ID": "ALAS2023-2024-773",
	"Author": "linux-security@amazon.com",
	"From": "linux-security@amazon.com",
	"Status": "final",
	"Type": "security",
	"Version": "1.4",
	"Title": "Amazon Linux 2023 - ALAS2023-2024-773: Important priority package update for python-waitress",
	"Issued": {
		"Date": "2024-12-05 20:34:00"
	},
	"Updated": {
		"Date": "2024-12-05 20:34:00"
	},
	"Severity": "Important",
	"Description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2024-49769:\n\tWaitress is a Web Server Gateway Interface server for Python 2 and 3. When a remote client closes the connection before waitress has had the opportunity to call getpeername() waitress won't correctly clean up the connection leading to the main thread attempting to write to a socket that no longer exists, but not removing it from the list of sockets to attempt to process. This leads to a busy-loop calling the write function. A remote attacker could run waitress out of available sockets with very little resources required. Waitress 3.0.1 contains fixes that remove the race condition.\n\nCVE-2024-49768:\n\tWaitress is a Web Server Gateway Interface server for Python 2 and 3. A remote client may send a request that is exactly recv_bytes (defaults to 8192) long, followed by a secondary request using HTTP pipelining. When request lookahead is disabled (default) we won't read any more requests, and when the first request fails due to a parsing error, we simply close the connection. However when request lookahead is enabled, it is possible to process and receive the first request, start sending the error message back to the client while we read the next request and queue it. This will allow the secondary request to be serviced by the worker thread while the connection should be closed. Waitress 3.0.1 fixes the race condition. As a workaround, disable channel_request_lookahead, this is set to 0 by default disabling this feature.\n",
	"References": {
		"Reference": [
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-49768",
				"ID": "CVE-2024-49768",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-49769",
				"ID": "CVE-2024-49769",
				"Title": "",
				"Type": "cve"
			}
		]
	},
	"Pkglist": {
		"Collection": {
			"Short": "amazon-linux-2023",
			"Name": "Amazon Linux 2023",
			"Package": [
				{
					"Arch": "noarch",
					"Epoch": "0",
					"Name": "python3-waitress",
					"Release": "1.amzn2023.0.3",
					"Version": "2.1.2",
					"Filename": "Packages/python3-waitress-2.1.2-1.amzn2023.0.3.noarch.rpm"
				}
			]
		}
	}
}
