{
	"ID": "ALAS2023-2024-539",
	"Author": "linux-security@amazon.com",
	"From": "linux-security@amazon.com",
	"Status": "final",
	"Type": "security",
	"Version": "1.4",
	"Title": "Amazon Linux 2023 - ALAS2023-2024-539: Important priority package update for composer",
	"Issued": {
		"Date": "2024-02-29 10:29:00"
	},
	"Updated": {
		"Date": "2024-02-29 10:29:00"
	},
	"Severity": "Important",
	"Description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2024-24821:\n\tComposer is a dependency Manager for the PHP language. In affected versions several files within the local working directory are included during the invocation of Composer and in the context of the executing user. As such, under certain conditions arbitrary code execution may lead to local privilege escalation, provide lateral user movement or malicious code execution when Composer is invoked within a directory with tampered files. All Composer CLI commands are affected, including composer.phar's self-update. The following scenarios are of high risk: Composer being run with sudo, Pipelines which may execute Composer on untrusted projects, Shared environments with developers who run Composer individually on the same project. This vulnerability has been addressed in versions 2.7.0 and 2.2.23. It is advised that the patched versions are applied at the earliest convenience. Where not possible, the following should be addressed: Remove all sudo composer privileges for all users to mitigate root privilege escalation, and avoid running Composer within an untrusted directory, or if needed, verify that the contents of `vendor/composer/InstalledVersions.php` and `vendor/composer/installed.php` do not include untrusted code.  A reset can also be done on these files by the following:```sh\nrm vendor/composer/installed.php vendor/composer/InstalledVersions.php\ncomposer install --no-scripts --no-plugins\n```\n",
	"References": {
		"Reference": [
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24821",
				"ID": "CVE-2024-24821",
				"Title": "",
				"Type": "cve"
			}
		]
	},
	"Pkglist": {
		"Collection": {
			"Short": "amazon-linux-2023",
			"Name": "Amazon Linux 2023",
			"Package": [
				{
					"Arch": "noarch",
					"Epoch": "0",
					"Name": "composer",
					"Release": "2.amzn2023.0.2",
					"Version": "2.5.8",
					"Filename": "Packages/composer-2.5.8-2.amzn2023.0.2.noarch.rpm"
				}
			]
		}
	}
}
