{
	"ID": "ALAS2023-2024-708",
	"Author": "linux-security@amazon.com",
	"From": "linux-security@amazon.com",
	"Status": "final",
	"Type": "security",
	"Version": "1.4",
	"Title": "Amazon Linux 2023 - ALAS2023-2024-708: Important priority package update for amazon-cloudwatch-agent",
	"Issued": {
		"Date": "2024-08-28 20:03:00"
	},
	"Updated": {
		"Date": "2024-09-04 12:40:00"
	},
	"Severity": "Important",
	"Description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2024-6104:\n\tgo-retryablehttp prior to 0.7.7 did not sanitize urls when writing them to its log file. This could lead to go-retryablehttp writing sensitive HTTP basic auth credentials to its log file. This vulnerability, CVE-2024-6104, was fixed in go-retryablehttp 0.7.7.\n\nCVE-2024-41110:\n\tAWS is aware of CVE-2024-41110, an issue affecting the Moby open source project, packaged in Amazon Linux as \"docker\". Docker is a component of several open source container management systems.\n\nThis issue does not affect the default configuration of docker. If an authorization plugin is enabled, a specially-crafted API request to the docker daemon will be forwarded to the authorization plugin in a way that could lead to unintended actions, such as privilege escalation. Enabling an authorization plugin is an atypical configuration. The affected API endpoint is not exposed to the network in either the default, typical, or recommended configurations. The default EKS and ECS configurations do not expose the API endpoint to the network. Enabling a Docker authorization plugin is not supported when using ECS. Finally, docker is not installed on EKS AMIs newer than 1.24. Although Docker is installed in EKS 1.24 and earlier, EKS does not support authorization plugins.\n\nUpdated docker packages addressing the issue are available for Amazon Linux 2 (docker-20.10.25-1.amzn2.0.5 and docker-25.0.6-1.amzn2.0.1) and for Amazon Linux 2023 (docker-25.0.6-1amzn2023.0.1). AWS recommends that customers using docker upgrade to these or later versions.\n\nCVE-2024-36129:\n\tThe OpenTelemetry Collector offers a vendor-agnostic implementation on how to receive, process and export telemetry data. An unsafe decompression vulnerability allows unauthenticated attackers to crash the collector via excessive memory consumption. OTel Collector version 0.102.1 fixes this issue.  It is also fixed in the confighttp module version 0.102.0 and configgrpc module version 0.102.1.\n\nCVE-2024-35255:\n\tAzure Identity Libraries and Microsoft Authentication Library Elevation of Privilege Vulnerability\n",
	"References": {
		"Reference": [
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-35255",
				"ID": "CVE-2024-35255",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-36129",
				"ID": "CVE-2024-36129",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-41110",
				"ID": "CVE-2024-41110",
				"Title": "",
				"Type": "cve"
			},
			{
				"Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-6104",
				"ID": "CVE-2024-6104",
				"Title": "",
				"Type": "cve"
			}
		]
	},
	"Pkglist": {
		"Collection": {
			"Short": "amazon-linux-2023",
			"Name": "Amazon Linux 2023",
			"Package": [
				{
					"Arch": "x86_64",
					"Epoch": "0",
					"Name": "amazon-cloudwatch-agent",
					"Release": "1.amzn2023",
					"Version": "1.300044.0",
					"Filename": "Packages/amazon-cloudwatch-agent-1.300044.0-1.amzn2023.x86_64.rpm"
				},
				{
					"Arch": "aarch64",
					"Epoch": "0",
					"Name": "amazon-cloudwatch-agent",
					"Release": "1.amzn2023",
					"Version": "1.300044.0",
					"Filename": "Packages/amazon-cloudwatch-agent-1.300044.0-1.amzn2023.aarch64.rpm"
				}
			]
		}
	}
}
