{
  "ID": "ALAS2DOCKER-2022-017",
  "Author": "linux-security@amazon.com",
  "From": "linux-security@amazon.com",
  "Status": "final",
  "Type": "security",
  "Version": "1.4",
  "Title": "Amazon Linux 2 - Docker 2.0 - ALAS2DOCKER-2022-017: important priority package update for docker",
  "Issued": {
    "Date": "2022-03-07 21:54"
  },
  "Updated": {
    "Date": "2022-03-08 18:29"
  },
  "Severity": "important",
  "Description": "Package updates are available for Amazon Linux 2 - Docker that fix the following vulnerabilities:\nCVE-2021-41092:\n\tDocker CLI is the command line interface for the docker container runtime. A bug was found in the Docker CLI where running `docker login my-private-registry.example.com` with a misconfigured configuration file (typically `~/.docker/config.json`) listing a `credsStore` or `credHelpers` that could not be executed would result in any provided credentials being sent to `registry-1.docker.io` rather than the intended private registry. This bug has been fixed in Docker CLI 20.10.9. Users should update to this version as soon as possible. For users unable to update ensure that any configured credsStore or credHelpers entries in the configuration file reference an installed credential helper that is executable and on the PATH.\n\nCVE-2021-41091:\n\tMoby is an open-source project created by Docker to enable software containerization. A bug was found in Moby (Docker Engine) where the data directory (typically `/var/lib/docker`) contained subdirectories with insufficiently restricted permissions, allowing otherwise unprivileged Linux users to traverse directory contents and execute programs. When containers included executable programs with extended permission bits (such as `setuid`), unprivileged Linux users could discover and execute those programs. When the UID of an unprivileged Linux user on the host collided with the file owner or group inside a container, the unprivileged Linux user on the host could discover, read, and modify those files. This bug has been fixed in Moby (Docker Engine) 20.10.9. Users should update to this version as soon as possible. Running containers should be stopped and restarted for the permissions to be fixed. For users unable to upgrade limit access to the host to trusted users. Limit access to host volumes to trusted containers.\n\nCVE-2021-41089:\n\tA file permissions vulnerability was found in Moby (Docker Engine). Copying files by using `docker cp` into a specially-crafted container can result in Unix file permission changes for existing files in the host's filesystem, which might lead to permissions escalation and allow an attacker access to restricted data.\n",
  "References": {
    "Reference": [
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41089",
        "ID": "CVE-2021-41089",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41091",
        "ID": "CVE-2021-41091",
        "Title": "",
        "Type": "cve"
      },
      {
        "Href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41092",
        "ID": "CVE-2021-41092",
        "Title": "",
        "Type": "cve"
      }
    ]
  },
  "Pkglist": {
    "Collection": {
      "Short": "amazon-linux-2---docker",
      "Name": "Amazon Linux 2 - Docker",
      "Package": [
        {
          "Arch": "aarch64",
          "Epoch": "0",
          "Name": "docker",
          "Release": "3.amzn2",
          "Version": "20.10.7",
          "Filename": "Packages/docker-20.10.7-3.amzn2.aarch64.rpm"
        },
        {
          "Arch": "aarch64",
          "Epoch": "0",
          "Name": "docker-debuginfo",
          "Release": "3.amzn2",
          "Version": "20.10.7",
          "Filename": "Packages/docker-debuginfo-20.10.7-3.amzn2.aarch64.rpm"
        },
        {
          "Arch": "x86_64",
          "Epoch": "0",
          "Name": "docker",
          "Release": "3.amzn2",
          "Version": "20.10.7",
          "Filename": "Packages/docker-20.10.7-3.amzn2.x86_64.rpm"
        },
        {
          "Arch": "x86_64",
          "Epoch": "0",
          "Name": "docker-debuginfo",
          "Release": "3.amzn2",
          "Version": "20.10.7",
          "Filename": "Packages/docker-debuginfo-20.10.7-3.amzn2.x86_64.rpm"
        }
      ]
    }
  }
}
